# GetDefaultLengthUnit Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseImportOptions..::..GetDefaultLengthUnit Method
BaseImportOptions Class See Also
---
Get the default length unit used for importing unitless files.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public ForgeTypeId GetDefaultLengthUnit()
```

Visual Basic
---
```text
Public Function GetDefaultLengthUnit As ForgeTypeId
```

Visual C++
---
```text
public:
ForgeTypeId^ GetDefaultLengthUnit()
```

# See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace